In [3]:
import csv
import pandas as pd
city_to_read = "Resources/city_data.csv"
ride_to_read = "Resources/ride_data.csv"

In [4]:
city_df = pd.read_csv(city_to_read)
ride_df = pd.read_csv(ride_to_read)
sum(city_df['type'] == "Rural")
print(city_df.head())
ride_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [6]:
ride_city_df = pd.merge(ride_df,city_df,how = "left",on =['city','city'])
ride_city_df.head(5)

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,Lake Jonathanshire,2019-04-07 20:51:11,31.25,4441251834598,5,Urban
2,Lake Jonathanshire,2019-03-09 23:45:55,19.89,2389495660448,5,Urban
3,Lake Jonathanshire,2019-04-07 18:09:21,24.28,7796805191168,5,Urban
4,Lake Jonathanshire,2019-01-02 14:14:50,13.89,424254840012,5,Urban
5,Lake Jonathanshire,2019-04-06 11:30:32,16.84,6164453571846,5,Urban
6,Lake Jonathanshire,2019-03-21 00:18:34,37.95,8353656732934,5,Urban
7,Lake Jonathanshire,2019-01-28 00:07:00,5.67,9756573174778,5,Urban
8,Lake Jonathanshire,2019-01-24 12:24:22,34.65,3319117904437,5,Urban
9,Lake Jonathanshire,2019-03-24 16:27:49,14.94,1670908453476,5,Urban
10,Lake Jonathanshire,2019-04-11 22:10:30,12.81,5999870428814,5,Urban
11,Lake Jonathanshire,2019-01-23 21:43:16,21.11,7711472105447,5,Urban
12,Lake Jonathanshire,2019-01-29 00:19:07,41.05,6649692036139,5,Urban
13,Lake Jonathanshire,2019-03-22 14:33:32,18.72,4675968803527,5,Urban
14,Lake Jonathanshire,2019-04-16 20:26:30,32.47,1013873953228,5,Urban